{
    "members": [{
            "id": 0,
            "name": "2021+: WHAT’S COMING NEXT?",
            "avatar": "https://image.freepik.com/free-vector/happy-new-year-greeting-card-with-with-2021-white-numbers-shape-christmas-ball-orange_1017-28831.jpg",
            "date": "8th , August, 2020",
            "author": "Tim Akano",
            "content": "In solitude, the mind gains strength and learns to lean upon itself. On the other side of the storm is the strength that comes from having navigated through it.",
            "preview": "It’s called the brave new world. Now. When the wind of change blows, says the Chinese proverb, some people build walls while others build windmills. What does our future holds in 2021? What lies at the other side of the pandemic coin- is it more breakdown or a breakthrough? What can we leverage in these crises to leapfrog, using the law of random opportunity? We could not change 2020, neither can we change the future, how best can we then prepare for what awaits humanity in 2021? How will the pandemic shape the coming year? Who blinks first in the on-going clash of civilisations between the East and the West? How will the current economic, technological, religious, and cultural revolutions pan out?"
        },
        {
            "id": 1,
            "name": "AS AMERICA’S SKY GETS DARK",
            "avatar": "https://image.freepik.com/free-vector/grunge-american-flag_1102-1132.jpg",
            "date": "27th September, 2020",
            "author": "Tim Akano",
            "content": "All empires fall, eventually. But why? It’s not for lack of power. In fact, it seems to be the opposite. Their power lulls them into comfort.",
            "preview": "No civilization is immutable. Power is in perpetual motion, has no permanent address, and no permanent telephone number. To access Power in the 15th Century, you ﬁrst had to dial +351 with Lisbon serving as its world’s headquarters; in the 16th Century, it was +34 with Toledo as the world’s centre of civilisation; the 17th Century belonged to +31 of the Dutch with Amsterdam as the world’s centre of gravity; in the 18th Century, it was Paris and its +33, with the cliché ‘’see Paris and die’ eloquently bearing testimony to how beautiful and powerful Paris was back then"
        },
        {
            "id": 2,
            "name": "STABILITY IN THE STORM",
            "avatar": "https://image.freepik.com/free-vector/realistic-lightning-bolts-flashes-composition-with-view-night-city-sky-with-clouds-thunderbolt-images_1284-28574.jpg",
            "date": "28th June 2020",
            "author": "Tim Akano",
            "content": "It is not the strongest or the most intelligent who will survive but those who can best manage change Learn from yesterday,live for today,hope for a better tomorrow,the thing important,is to not stop learning,Be patient and tough,Someday, this pain will be useful to you.",
            "preview": "Where are the ’EXIT’ signs? Or when will things return to normal? When are we landing and at which airport? What just happened? What comes next? Musing. Soliloquising. Thinking aloud. Connecting the dots. Plotting the graphs. 2020 is distinct, it is not your typical linear graph year, and therefore, plotting the points requires special techniques, insights and uncommon graphing mental magnitude. Even then, what use are the exit signs when the world is no longer a global village but one huge apartment complex consisting of 193 independent buildings with en-suite facilities?"
        },
        {
            "id": 3,
            "name": "The Collapsing World Bridge",
            "avatar": "https://image.freepik.com/free-photo/sunrise-vasco-da-gama-bridge-lisbon-portugal_268835-1338.jpg",
            "date": "31st May, 2020",
            "author": "Tim Akano",
            "content": "The bridge of peace is collapsing and the bridge of war is now under construction, perhaps at faster rate than the collapse of the bridge of peace.",
            "preview": "Unarguably, the world’s bridge is collapsing. The Political, Economic, Social, Health. Military, Education and Cultural bridges that connect us are all falling apart, in different direction at different degrees. The bridge of peace is collapsing and the bridge of war is now under construction, perhaps at faster rate than the collapse of the bridge of peace. Multilateralism and globalization are the glue that holds humanity together. Both are rapidly becoming anachronism."
        },
        {
            "id": 4,
            "name": "THE SANDS ARE SHIFTING… 1",
            "avatar": "https://image.freepik.com/free-photo/change-word-wooden-background_23-2148227738.jpg",
            "date": "29th November, 2020",
            "author": "Tim Akano",
            "content": "Life is a desert of shifting sand dunes. Unpredictable. Erratic. Harmony changes into dissonance, the immediate outlives the profound, esoteric becomes clichéd.",
            "preview": "The world is about to really get ugly and more complicated from 2021-2030. Being a transition decade, the Universe, like a snake, is going through the process of ecdysis. That is the shedding of an old layer of a snake’s skin in one continuous process. That transition which began in 2020 will crystalize in 2030 with the emergence of a New World Order. However, as the snake never returns to the same spot where ecdysis occurred, the Universe we knew pre-COVID-19 era is gone forever."
        },
        {
            "id": 5,
            "name": "Finding the 18th Duck…or Finding the Steve Jobs’ Way",
            "avatar": "https://image.freepik.com/free-vector/old-treasure-map-with-islands-caribbean-sea_8071-3991.jpg",
            "date": "1st October, 2021",
            "author": "Tim Akano",
            "content": "There is a tide in the affairs of men (Nations), which taken at the flood, leads on to fortune. Omitted, all the voyage of their life is bound in shallows and in miseries.",
            "preview": "Brutus to Cassius in Julius Caesar by William Shakespeare put it succinctly: ’’There is a tide in the affairs of men (Nations), which taken at the flood, leads on to fortune. Omitted, all the voyage of their life is bound in shallows and in miseries. On such a full sea are we now afloat. And we must take the current when it serves, or lose our ventures’’. In Greek rhetoric, it is called: ’KAIROS’ i.e. the ideal moment for a significant, strategic strike."
        },
        {
            "id": 6,
            "name": "MAXIMIZING RANDOM OPPORTUNITIES",
            "avatar": "https://image.freepik.com/free-photo/man-jumping-impossible-possible-cliff-sunset-background-business-concept-idea_1323-266.jpg",
            "date": "10th October, 2021",
            "author": "Tim Akano",
            "content": "Where do global, lives-altering, winning ideas come from? Academic excellence? Marketing Researchers? Through Philosophers? Career guardians and counsellors? All of the above but not necessarily. One unique source of world-changing ideas is RANDOMNESS.",
            "preview": "I believe Shakespeare in Julius Caesar was (is) right when he concluded that there is a tide in the affairs of men, Which, taken at the flood, lead on to fortune, Omitted, all the voyage of their life Is bound in shallows and in miseries. On such a full sea are we now afloat, And we must take the current when it serves, Or lose our ventures Parents, teachers, religious instructors and motivational speakers all preach the  need to have a well written goals, vision and mission statement in order to score a goal in the Game of Life. Correct, but not sufficient.  Of all the teenagers who dreamed of becoming world champions and billionaires in entrepreneurship,"
        },
        {
            "id": 7,
            "name": "Collaboration vs Total Ownership Mentality -TOM",
            "avatar": "https://image.freepik.com/free-photo/business-people-clapping-hands-together_53876-14938.jpg",
            "date": "12th October, 2021",
            "author": "Tim Akano",
            "content": "How come 18 African billionaires made the Forbes 2021 ranking list of the world's richest people but there is no single African-owned company on the 2021 Fortune Global 500 companies ranking?",
            "preview": "How come 18 African billionaires made the Forbes 2021 ranking list of the world's richest people but there is no single African-owned company on the 2021 Fortune Global 500 companies ranking? Does that mean African billionaires can't or don't know how to build Global Fortune 500 companies or there is no correlation between Africa's billionaires wealth and productivity? Aliko Dangote, for instance, remains Africa's Class Captain as the number one richest man in Africa with $12.8 billion net worth. Others include Nassef Sawiris of Egypt, Mike Adenuga of Nigeria, Nicky Oppenheimer of South Africa, and Abdulsamad Rabiu (net worth of $5.5 billion) of BUA Group among others. "
        },
        {
            "id": 8,
            "name": "The Game of Life & The 3 Teams Featuring",
            "avatar": "https://image.freepik.com/free-photo/clock-beach-time-business-concept_1204-346.jpg",
            "date": "14th, October 2021",
            "author": "Tim Akano",
            "content": "Nigerians are great people but the nation is perpetually on the brink with blinking, non stop red light which signifies imminent existential threats.",
            "preview": "At the continental level, Africa is the Team Captain while at the nation-state state, Nigeria (not Nigerians), is the class captain, assisted by Venezuela and Iran, the three other hugely blessed but inexplicably poor nations. Nigerians are great people but the nation is perpetually on the brink with blinking, non stop red light which signifies imminent existential threats. The phrase, Nigeria: Great People, poorly or badly or terribly managed nation is apt. Also, for 600 years, Africans as a race have been pushed forcefully to the civilization's fringe by other racetrack will take a stronger force to write another Program that will undo the code written for Africa by other races."
        }

    ]
}