{
    "members": [{
            "id": 0,
            "name": "2021+: WHAT’S COMING NEXT?",
            "avatar": "https://image.freepik.com/free-vector/happy-new-year-greeting-card-with-with-2021-white-numbers-shape-christmas-ball-orange_1017-28831.jpg",
            "date": "8th , August, 2020",
            "author": "Tim Akano",
            "hyperlink": "https://drive.google.com/file/d/1dYXQNkDNoM6gqlTM72PEmE5dqbvz4P3O/view?usp=sharing",
            "content": "In solitude, the mind gains strength and learns to lean upon itself. On the other side of the storm is the strength that comes from having navigated through it.",
            "preview": "It’s called the brave new world. Now. When the wind of change blows, says the Chinese proverb, some people build walls while others build windmills. What does our future holds in 2021? What lies at the other side of the pandemic coin- is it more breakdown or a breakthrough? What can we leverage in these crises to leapfrog, using the law of random opportunity? We could not change 2020, neither can we change the future, how best can we then prepare for what awaits humanity in 2021? How will the pandemic shape the coming year? Who blinks first in the on-going clash of civilisations"
        },
        {
            "id": 1,
            "name": "AS AMERICA’S SKY GETS DARK",
            "avatar": "https://image.freepik.com/free-vector/grunge-american-flag_1102-1132.jpg",
            "date": "27th September, 2020",
            "author": "Tim Akano",
            "hyperlink": "https://drive.google.com/file/d/1n2XRzlA1f2cKvAS8Ex4ItteFVrsMmXm_/view?usp=sharing",
            "content": "All empires fall, eventually. But why? It’s not for lack of power. In fact, it seems to be the opposite. Their power lulls them into comfort.",
            "preview": "No civilization is immutable. Power is in perpetual motion, has no permanent address, and no permanent telephone number. To access Power in the 15th Century, you ﬁrst had to dial +351 with Lisbon serving as its world’s headquarters; in the 16th Century, it was +34 with Toledo as the world’s centre of civilisation; the 17th Century belonged to +31 of the Dutch with Amsterdam as the world’s centre of gravity; in the 18th Century, it was Paris and its +33, with the cliché ‘’see Paris and die’ eloquently bearing testimony to how beautiful and powerful Paris was back then"
        },
        {
            "id": 2,
            "name": "STABILITY IN THE STORM",
            "avatar": "https://image.freepik.com/free-vector/realistic-lightning-bolts-flashes-composition-with-view-night-city-sky-with-clouds-thunderbolt-images_1284-28574.jpg",
            "date": "28th June 2020",
            "author": "Tim Akano",
            "hyperlink": "https://drive.google.com/file/d/1KiNXTJVkjHywIe6OzQ5kUXu4y5-YX-ub/view?usp=sharing",
            "content": "It is not the strongest or the most intelligent who will survive but those who can best manage change Learn from yesterday,live for today,hope for a better tomorrow,the thing important,is to not stop learning",
            "preview": "Where are the ’EXIT’ signs? Or when will things return to normal? When are we landing and at which airport? What just happened? What comes next? Musing. Soliloquising. Thinking aloud. Connecting the dots. Plotting the graphs. 2020 is distinct, it is not your typical linear graph year, and therefore, plotting the points requires special techniques, insights and uncommon graphing mental magnitude. Even then, what use are the exit signs when the world is no longer a global village but one huge apartment complex consisting of 193 independent buildings with en-suite facilities?"
        },
        {
            "id": 3,
            "name": "The Collapsing World Bridge",
            "avatar": "https://image.freepik.com/free-photo/sunrise-vasco-da-gama-bridge-lisbon-portugal_268835-1338.jpg",
            "date": "31st May, 2020",
            "author": "Tim Akano",
            "hyperlink": "https://drive.google.com/file/d/1SlSorD7KnzLIjgQDGxa4UMRyszRQr_yv/view?usp=sharing",
            "content": "The bridge of peace is collapsing and the bridge of war is now under construction, perhaps at faster rate than the collapse of the bridge of peace.",
            "preview": "Unarguably, the world’s bridge is collapsing. The Political, Economic, Social, Health. Military, Education and Cultural bridges that connect us are all falling apart, in different direction at different degrees. The bridge of peace is collapsing and the bridge of war is now under construction, perhaps at faster rate than the collapse of the bridge of peace. Multilateralism and globalization are the glue that holds humanity together. Both are rapidly becoming anachronism."
        },
        {
            "id": 4,
            "name": "THE SANDS ARE SHIFTING… 1",
            "avatar": "https://image.freepik.com/free-photo/change-word-wooden-background_23-2148227738.jpg",
            "date": "29th November, 2020",
            "author": "Tim Akano",
            "hyperlink": "https://drive.google.com/file/d/16MziTjNW_mgYCKC4pXpr4IUFZRmAzNVV/view?usp=sharing",
            "content": "Life is a desert of shifting sand dunes. Unpredictable. Erratic. Harmony changes into dissonance, the immediate outlives the profound, esoteric becomes clichéd.",
            "preview": "The world is about to really get ugly and more complicated from 2021-2030. Being a transition decade, the Universe, like a snake, is going through the process of ecdysis. That is the shedding of an old layer of a snake’s skin in one continuous process. That transition which began in 2020 will crystalize in 2030 with the emergence of a New World Order. However, as the snake never returns to the same spot where ecdysis occurred, the Universe we knew pre-COVID-19 era is gone forever."
        },
        {
            "id": 5,
            "name": "Finding the 18th Duck…or Finding the Steve Jobs’ Way",
            "avatar": "https://image.freepik.com/free-vector/old-treasure-map-with-islands-caribbean-sea_8071-3991.jpg",
            "date": "1st October, 2021",
            "author": "Tim Akano",
            "hyperlink": "https://drive.google.com/file/d/1WoeXKF8y13U5Y_YoJ7KkiKiIARKR-u2N/view?usp=sharing",
            "content": "There is a tide in the affairs of men (Nations), which taken at the flood, leads on to fortune. Omitted, all the voyage of their life is bound in shallows and in miseries.",
            "preview": "Brutus to Cassius in Julius Caesar by William Shakespeare put it succinctly: ’’There is a tide in the affairs of men (Nations), which taken at the flood, leads on to fortune. Omitted, all the voyage of their life is bound in shallows and in miseries. On such a full sea are we now afloat. And we must take the current when it serves, or lose our ventures’’. In Greek rhetoric, it is called: ’KAIROS’ i.e. the ideal moment for a significant, strategic strike."
        },
        {
            "id": 6,
            "name": "MAXIMIZING RANDOM OPPORTUNITIES",
            "avatar": "https://image.freepik.com/free-photo/man-jumping-impossible-possible-cliff-sunset-background-business-concept-idea_1323-266.jpg",
            "date": "10th October, 2021",
            "author": "Tim Akano",
            "hyperlink": "https://drive.google.com/file/d/1K_vepHFzhN4Qq_dabx0kcFGPJN4Kqk5K/view?usp=sharing",
            "content": "Where do global, lives-altering, winning ideas come from? Academic excellence? Marketing Researchers? Through Philosophers? Career guardians and counsellors? All of the above but not",
            "preview": "I believe Shakespeare in Julius Caesar was (is) right when he concluded that there is a tide in the affairs of men, Which, taken at the flood, lead on to fortune, Omitted, all the voyage of their life Is bound in shallows and in miseries. On such a full sea are we now afloat, And we must take the current when it serves, Or lose our ventures Parents, teachers, religious instructors and motivational speakers all preach the  need to have a well written goals, vision and mission statement in order to score a goal in the Game of Life. Correct, but not sufficient."
        },
        {
            "id": 7,
            "name": "Collaboration vs Total Ownership Mentality -TOM",
            "avatar": "https://image.freepik.com/free-photo/business-people-clapping-hands-together_53876-14938.jpg",
            "date": "12th October, 2021",
            "author": "Tim Akano",
            "hyperlink": "https://drive.google.com/file/d/1yTpx0vNiwsNzlBKhnu-7svkhXjcy8895/view?usp=sharing",
            "content": "How come 18 African billionaires made the Forbes 2021 ranking list of the world's richest people but there is no single African-owned company on the 2021 Fortune Global 500 companies ranking?",
            "preview": "How come 18 African billionaires made the Forbes 2021 ranking list of the world's richest people but there is no single African-owned company on the 2021 Fortune Global 500 companies ranking? Does that mean African billionaires can't or don't know how to build Global Fortune 500 companies or there is no correlation between Africa's billionaires wealth and productivity? Aliko Dangote, for instance, remains Africa's Class Captain as the number one richest man in Africa with $12.8 billion net worth. Others include Nassef Sawiris of Egypt, Mike Adenuga of Nigeria,"
        },
        {
            "id": 8,
            "name": "The Game of Life & The 3 Teams Featuring",
            "avatar": "https://image.freepik.com/free-photo/clock-beach-time-business-concept_1204-346.jpg",
            "date": "14th October, 2021",
            "author": "Tim Akano",
            "hyperlink": "https://drive.google.com/file/d/1xz7fTMBDaCrFeXtWJZbiSjsIdXJwFjxM/view?usp=sharing",
            "content": "Nigerians are great people but the nation is perpetually on the brink with blinking, non stop red light which signifies imminent existential threats.",
            "preview": "At the continental level, Africa is the Team Captain while at the nation-state state, Nigeria (not Nigerians), is the class captain, assisted by Venezuela and Iran, the three other hugely blessed but inexplicably poor nations. Nigerians are great people but the nation is perpetually on the brink with blinking, non stop red light which signifies imminent existential threats. The phrase, Nigeria: Great People, poorly or badly or terribly managed nation is apt. Also, for 600 years, Africans as a race have been pushed forcefully to the civilization's fringe by "
        },
        {
            "id": 9,
            "name": "MEGA WEALTH'S NEW COLOR",
            "avatar": "https://image.freepik.com/free-vector/global-bitcoin-growth-arrow-chart-background_1017-33590.jpg",
            "date": "31st October, 2021",
            "author": "Tim Akano",
            "hyperlink": "https://drive.google.com/file/d/18PHQwp1-yNl9f5dKiF9mncP-KuVstE0b/view?usp=sharing",
            "content": "let us interrogate the new color of Mega wealth: how the  world's top ten richest men (No women, no African yet) made their money. Are there striking similarities among them that  young African leaders can learn from in our relentless quest for  a veritable transformation road-map?",
            "preview": "Always something new out of Africa once in a century, i.e. YOU Whole world can change 360 degrees within a generation as it happened in UAE and with the Irish Once, not too long ago, the Irish were the butt of embarrassing jokes about compound stupidity, laziness and drunkenness A generation came and canceled the deficit and built a strong Irish civilization that has produced 23 out of 45 American Presidents! No other race has done this No one tells those ridiculous Irish jokes any more Africa needs just one different generation and 20 Jeff Bozos to put an end to the embarrassing underdevelopment in Africa."
        },
        {
            "id": 10,
            "name": "Everyday Greatness Guide",
            "avatar": "https://image.freepik.com/free-vector/success-concept-ladder-with-glowing-light-bulb_1017-32076.jpg",
            "date": "5th November, 2021",
            "author": "Tim Akano",
            "hyperlink": "https://drive.google.com/file/d/143m4ACVBtd4kB9B07ohlb54AqCRL4ECH/view?usp=sharing",
            "content": "Our Mind is the photocopier, the Toner represents our Thoughts while the Paper is the words that come out of our mouth and the machine's Scanner stands for our Eyes whatever the eyes see, gets scanned and sent to the mind for duplication.",
            "preview": "Our Mind is the photocopier, the Toner represents our Thoughts while the Paper is the words that come out of our mouth and the machine's Scanner stands for our Eyes whatever the eyes see, gets scanned and sent to the mind for duplication.Creation is always happening on a per second basis,  it is forever work-in-progress, constantly and clinically reproducing our thought into its physical equivalent, without alterations.Whatsoever we think, visualise, dwell on and say gets xeroxed by the mind-copier machine. We receive mint duplicate copies of our cumulative dominant thoughts, in due season. No cheating."
        },
        {
            "id": 11,
            "name": "AFTER GOD, GEOGRAPHY",
            "avatar": "https://image.freepik.com/free-vector/vintage-world-map-sepia-shades-background_23-2148325814.jpg",
            "date": "7th December, 2021",
            "author": "Tim Akano",
            "hyperlink": "https://drive.google.com/file/d/1TvN8KGjfuoet3ksZ_snA8ogQSjn0O59V/view?usp=sharing",
            "content": "God is like electricity. Anytime one switches on the light bulb, darkness automatically disappears from the environment and the mind, both receive illumination concomitantly. Ignorance of the sucket's location in the room/mind is not synonymous with absence of Light",
            "preview": "Of the 2 G's (God and Geography), cracking the former code is much easier than the latter. Why? The first G is a question of practical personal choice, unlike geography that requires wisdom of the Team for activation. God is like electricity. Anytime one switches on the light bulb, darkness automatically disappears from the environment and the mind, both receive illumination concomitantly. Ignorance of the sucket's location in the room/mind is not synonymous with absence of Light. The Light is ever present and always ready to work with us but certainly not for us."
        },
        {
            "id": 12,
            "name": "INTERROGATING WORLD OF WATER & WELTER OF WARS",
            "avatar": "https://img.freepik.com/free-photo/african-woman-pouring-water-recipient-outdoors_23-2149021909.jpg?t=st=1649357288~exp=1649357888~hmac=e6d045583c239339b305d42778f95ae5dbf9fd65cf7ce408670cf8b6cc9066ed&w=826",
            "date": "7th April, 2022",
            "author": "Tim Akano",
            "hyperlink": "https://drive.google.com/file/d/1TvN8KGjfuoet3ksZ_snA8ogQSjn0O59V/view?usp=sharing",
            "content": "Of all the Nature's creations, Water seems to be the simplest but the most consequential. Water consists of just 2 atoms of hydrogen and 1 atom of oxygen (H2o). Water is life. A life without water becomes extinguished within 72 hours! Water is king.",
            "preview": "Water- stressed areas are   where water use exceeds  the natural renewable water supply and puts fresh water ecosystem at risk. In Thailand and Dominican Republic over 50% of the urban population depend on bottled water as its primary drinking water source. But Why should the world be  carrying the burden of thirst in the midst of water? One, 97% of water is salty. Two, 2% is freshwater but tucked in snow and ice. Three, only 1% of freshwater is left for about 8 billion people for agriculture, drinking  and bathing, of which agriculture takes 70% of the 1% available fresh water. This is the crux of the matter."
        },
        {
            "id": 13,
            "name": "INNOVATION, AGE & THE THEORY OF DEADWOOD",
            "avatar": "https://images.unsplash.com/photo-1517264277371-1d8f5d63e3ba?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80",
            "date": "7th April, 2022",
            "author": "Tim Akano",
            "hyperlink": "https://drive.google.com/file/d/1jDlofynGZt2ej31imUbxiPh_BCPuZetU/view?usp=sharing",
            "content": "Is there a one-to-one relationship between innovation and age, and at what age do we become deadwood? We all believe that life is finite. While some scientists believe age is nothing more than a mere set of numbers that provides opportunities to celebrate with our friends and well wishers, others believe that age is a strong determinant factor in creativity and that we peak between 15- 39 and become deadwood at 50.",
            "preview": "The Japanese popular artist was a frontline proponent of the former school of thought: All I have real structure of nature. When I am 80, I shall have made still more progress . At 90, I shall penetrate produced before the age of 70 is not worth taking into account At 73, I have learned a little about the the mystery of things. At 100, I shall have reached a marvelous stage, and when I am 110, everything I do, whether it be a dot or a line, will be alive Hokusai lived to be almost 90 before he died and created his most iconic woodblock print: The Great Wave Off Kanagawa when he was nearing life's departure lounge."
        },
        {
            "id": 14,
            "name": "INTERROGATING THE PRODIGAL SON’S OPTION",
            "avatar": "https://images.unsplash.com/photo-1417816491410-d61e1546e539?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=774&q=80",
            "date": "5th June, 2022",
            "author": "Tim Akano",
            "hyperlink": "https://drive.google.com/file/d/1Oh537h3cTQ5vTUx4g22mrX9w38WT4ZhQ/view?usp=sharing",
            "content": "If you raised one tiger, hyena, leopard, jaguar, lion, cheetah, cougar (1 each big cat species) together from birth, would they coexist productively in the same restricted, fenced territory? No. Because they all have distinct social needs and inborn 'pack' dynamics. Each cat comes with a unique edge: tiger's powerful legs and razor sharp teeth, leopard's climbing skill, hyena's biting force and cheetah's speed.",
            "preview": "I look at the oil and gas industry, for instance. I wonder if it is the same oil and gas that Norway, UAE and Saudi Arabia are selling that Nigeria is selling; if it is, then Nigeria must either be fictional or tragicomedy. We will need the services of the best cosmonauts and Deep-Sea Divers to help explore the Space and underwater, in search of the missing oil-rich Nigeria. Politically, It is a season of 'choice' again, seven years ago, the choice was between the Devil and the Deep Blue Sea, but today, the 'choice' is between two confirmed EVILS!"
        }
    ]
}